Задача 50. Напишите программу, которая на вход принимает позиции элемента в двумерном массиве, и возвращает значение этого элемента или же указание, что такого элемента нет.

Например, задан массив:
1 4 7 2
5 9 2 3
8 4 2 4
17 -> такого числа в массиве нет


=================================================================================================
1. Сначала определен двумерный массив  array  с помощью инициализации значений в фигурных скобках. В данном случае, это массив размером 3x4. 
 
2. Затем программа запрашивает у пользователя номер строки и столбца элемента, которое он хочет проверить. 
 
3. После ввода номера строки и столбца, программа проверяет, находится ли введенная позиция в допустимых границах массива с помощью условия  row >= 0 && row < array.GetLength(0) && column >= 0 && column < array.GetLength(1) . Если позиция введена корректно, то программа переходит к следующему шагу. Если позиция выходит за границы массива, программа выводит сообщение "Такого элемента нет в массиве." 
 
4. Если позиция введена корректно, программа выводит значение элемента массива  array[row, column]  с помощью выражения `Console.WriteLine("Значение элемента: " + array[row, column]);`. 
 
Таким образом, данный код позволяет пользователю проверять значения элементов в двумерном массиве по указанным позициям и выводит результат на консоль.